[
  {
    "image": "https://i.ibb.co.com/jvW3p8Qg/1.webp",
    "title": "ChatFlow",
    "companyName": "ByteWorks Ltd",
    "id": 1,
    "description": "ChatFlow is an intelligent AI-powered communication platform designed for teams, freelancers, and businesses. It helps users automate replies, summarize long conversations, and manage multiple chats across different platforms in one place. With built-in natural language processing, it learns your tone and adapts accordingly. ChatFlow supports real-time translation, multi-device sync, and integration with CRMs like HubSpot or Notion. Its privacy-first design ensures all data is encrypted end-to-end. You can also set custom workflows to auto-reply, schedule messages, or escalate queries. It’s ideal for companies that want both speed and personalization in communication. With ChatFlow, collaboration becomes smoother, faster, and more productive every single day.",
    "size": 85,
    "reviews": 10432,
    "ratingAvg": 4.6,
    "downloads": 0.5,
    "ratings": [
      { "name": "1 star", "count": 320 },
      { "name": "2 star", "count": 450 },
      { "name": "3 star", "count": 1220 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 5942 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/wmCHzZW/2.png",
    "title": "TaskPilot",
    "companyName": "NexGen Studios",
    "id": 2,
    "description": "TaskPilot is your personal productivity companion built to simplify your daily life. It combines task management, calendar integration, and intelligent reminders into one clean interface. Whether you’re managing team projects or personal goals, TaskPilot adapts to your workflow. The app automatically categorizes your tasks, suggests deadlines based on your habits, and tracks performance metrics. You can share projects, add notes, and attach files seamlessly. With beautiful data visualization, you can see your weekly and monthly progress. Offline access ensures you stay organized anytime. TaskPilot makes productivity feel effortless.",
    "size": 64,
    "reviews": 8321,
    "ratingAvg": 4.4,
    "downloads": 0.42,
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 740 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2300 },
      { "name": "5 star", "count": 3381 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/tPP2FhsH/3.webp",
    "title": "PhotoSnap",
    "companyName": "VisionSoft",
    "id": 3,
    "description": "PhotoSnap is a modern photography platform that empowers users to capture, enhance, and share images in seconds. It provides AI-based editing tools such as automatic lighting adjustment, blemish correction, and color balancing. Users can experiment with professional-grade filters and manage albums in cloud storage. The app supports RAW image editing and real-time background replacement. Social features let you showcase work, follow creators, and receive feedback. Whether you’re an amateur or a professional, PhotoSnap helps turn everyday moments into stunning visual stories.",
    "size": 110,
    "reviews": 23000,
    "ratingAvg": 4.8,
    "downloads": 1.2,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2500 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 13300 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/xKYDy1h2/4.jpg",
    "title": "MusicHive",
    "companyName": "TuneZone Inc",
    "id": 4,
    "description": "MusicHive is a vibrant streaming hub that connects you to millions of songs, playlists, and live sessions worldwide. It offers personalized recommendations using AI and mood recognition. You can download tracks for offline listening, create collaborative playlists, and even explore local radio stations. The app’s adaptive sound engine enhances audio quality automatically depending on your device. With a minimal design and smooth navigation, MusicHive delivers both entertainment and discovery. It’s perfect for every mood, moment, and listener.",
    "size": 98,
    "reviews": 45000,
    "ratingAvg": 4.7,
    "downloads": 2.5,
    "ratings": [
      { "name": "1 star", "count": 2000 },
      { "name": "2 star", "count": 2700 },
      { "name": "3 star", "count": 5600 },
      { "name": "4 star", "count": 9700 },
      { "name": "5 star", "count": 25900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/8DPtktKm/5.png",
    "title": "FitTrack",
    "companyName": "CoreHealth",
    "id": 5,
    "description": "FitTrack helps you stay on top of your health goals by tracking workouts, calories, heart rate, and sleep patterns. It integrates seamlessly with wearables like smartwatches and fitness bands. The app provides personalized workout plans, progress analytics, and meal suggestions based on your goals. Users can monitor trends through detailed graphs and weekly summaries. FitTrack also includes motivational challenges and social features for accountability. Whether you’re training professionally or just starting, FitTrack keeps your wellness journey data-driven and inspiring.",
    "size": 72,
    "reviews": 12750,
    "ratingAvg": 4.3,
    "downloads": 0.8,
    "ratings": [
      { "name": "1 star", "count": 850 },
      { "name": "2 star", "count": 1100 },
      { "name": "3 star", "count": 1900 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 5900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/HLCCc76m/6.jpg",
    "title": "EduMate",
    "companyName": "Learnify Co.",
    "id": 6,
    "description": "EduMate is an interactive e-learning platform that connects students and teachers in real-time classrooms. It supports live quizzes, discussion forums, and assignment tracking. Built for modern education, it offers multimedia lectures, gamified learning paths, and adaptive difficulty levels. Teachers can analyze student performance through AI dashboards and generate instant feedback reports. Students enjoy a smooth, collaborative learning experience from anywhere in the world. EduMate makes learning engaging, accessible, and fun for everyone.",
    "size": 140,
    "reviews": 9000,
    "ratingAvg": 4.5,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1600 },
      { "name": "4 star", "count": 2400 },
      { "name": "5 star", "count": 4400 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/QvhPkx12/7.webp",
    "title": "GameBox",
    "companyName": "PlayVerse",
    "id": 7,
    "description": "GameBox is a unified gaming hub where users can access hundreds of cloud-based games without downloads or hardware limits. It supports multiplayer lobbies, leaderboards, and real-time chat features. Players can stream gameplay directly, earn in-app rewards, and personalize their dashboards. GameBox optimizes each title based on device performance and internet speed. From casual mobile games to AAA releases, it provides instant access to entertainment anywhere, anytime. GameBox truly defines the future of gaming convenience.",
    "size": 250,
    "reviews": 56000,
    "ratingAvg": 4.2,
    "downloads": 3,
    "ratings": [
      { "name": "1 star", "count": 5400 },
      { "name": "2 star", "count": 7200 },
      { "name": "3 star", "count": 10400 },
      { "name": "4 star", "count": 13000 },
      { "name": "5 star", "count": 20000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/S46YbwHb/8.pngs",
    "title": "TravelGo",
    "companyName": "FlyTech Solutions",
    "id": 8,
    "description": "TravelGo is your all-in-one travel planner — book flights, reserve hotels, and organize trips effortlessly. It compares thousands of offers to find the best deals in real time. The app includes itinerary builders, visa checkers, and destination guides. TravelGo’s AI assistant gives personalized suggestions for attractions, food, and activities based on your preferences. Offline maps, budget estimators, and weather updates ensure smooth travel experiences. Whether it’s a business trip or a weekend getaway, TravelGo simplifies every step.",
    "size": 120,
    "reviews": 15500,
    "ratingAvg": 4.6,
    "downloads": 0.9,
    "ratings": [
      { "name": "1 star", "count": 900 },
      { "name": "2 star", "count": 1200 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 3400 },
      { "name": "5 star", "count": 7900 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/TMkNSX43/9.png",
    "title": "Noteify",
    "companyName": "CloudSync",
    "id": 9,
    "description": "Noteify is a minimalistic yet powerful note-taking app that synchronizes your ideas across all devices. You can write, draw, record, and attach images seamlessly. Notes are automatically categorized and searchable by tags or voice commands. It also supports collaborative editing and offline mode. CloudSync keeps every note updated, even across multiple platforms. Noteify empowers you to capture inspiration the moment it strikes, helping you stay organized and creative wherever you go.",
    "size": 52,
    "reviews": 8700,
    "ratingAvg": 4.4,
    "downloads": 0.5,
    "ratings": [
      { "name": "1 star", "count": 450 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1400 },
      { "name": "4 star", "count": 2600 },
      { "name": "5 star", "count": 3650 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qYhHgZHg/10.webp",
    "title": "BudgetBuddy",
    "companyName": "FinPro Systems",
    "id": 10,
    "description": "BudgetBuddy is an AI-based financial assistant that helps you track spending, set budgets, and achieve financial goals. It categorizes transactions automatically and displays real-time balance insights. With smart predictions, it notifies you of potential overspending or missed bills. BudgetBuddy supports multiple currencies and integrates with bank accounts securely. Its sleek dashboard gives a complete overview of income, savings, and expenses. Whether you’re managing personal or business finances, BudgetBuddy ensures smarter money management.",
    "size": 80,
    "reviews": 6400,
    "ratingAvg": 4.1,
    "downloads": 0.4,
    "ratings": [
      { "name": "1 star", "count": 700 },
      { "name": "2 star", "count": 900 },
      { "name": "3 star", "count": 1300 },
      { "name": "4 star", "count": 1900 },
      { "name": "5 star", "count": 1600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/60wfVzwY/11.jpg",
    "title": "MindSpace",
    "companyName": "ZenLabs",
    "id": 11,
    "description": "MindSpace promotes mental health and emotional wellness through guided meditations, calming music, and breathing exercises. It features daily reflection journals, sleep stories, and focus sessions for productivity. MindSpace tracks your mood and suggests practices accordingly. You can join live meditation sessions or connect with mental wellness coaches. With a serene interface and scientifically designed programs, it helps reduce anxiety and improve focus. MindSpace is more than an app — it’s your companion for peace of mind.",
    "size": 70,
    "reviews": 22000,
    "ratingAvg": 4.9,
    "downloads": 1.5,
    "ratings": [
      { "name": "1 star", "count": 400 },
      { "name": "2 star", "count": 600 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 17000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YB56qWZg/12.png",
    "title": "CookEase",
    "companyName": "Foodify",
    "id": 12,
    "description": "CookEase makes home cooking enjoyable and effortless. It offers thousands of easy-to-follow recipes curated by chefs worldwide. Each recipe includes step-by-step video tutorials, calorie breakdowns, and ingredient substitution options. Users can plan weekly meals, generate grocery lists automatically, and even share custom recipes. CookEase also supports dietary filters like vegan, gluten-free, or keto. Whether you’re a beginner or an experienced cook, CookEase transforms your kitchen experience with simplicity and creativity.",
    "size": 95,
    "reviews": 7600,
    "ratingAvg": 4.5,
    "downloads": 0.6,
    "ratings": [
      { "name": "1 star", "count": 600 },
      { "name": "2 star", "count": 700 },
      { "name": "3 star", "count": 1100 },
      { "name": "4 star", "count": 2000 },
      { "name": "5 star", "count": 3200 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/rRYY0wLQ/13.png",
    "title": "LangLearn",
    "companyName": "EduWorld",
    "id": 13,
    "description": "LangLearn redefines how you learn new languages. It combines fun, gamified lessons with real-time pronunciation feedback. Users can chat with AI tutors, complete daily challenges, and track progress through interactive graphs. The app covers grammar, vocabulary, and speaking exercises. It even simulates real-life conversations for immersive practice. With over 30 languages and adaptive difficulty, LangLearn makes mastering a new language enjoyable for learners of all levels.",
    "size": 130,
    "reviews": 15800,
    "ratingAvg": 4.6,
    "downloads": 0.85,
    "ratings": [
      { "name": "1 star", "count": 800 },
      { "name": "2 star", "count": 1000 },
      { "name": "3 star", "count": 1800 },
      { "name": "4 star", "count": 3500 },
      { "name": "5 star", "count": 8700 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/YFv9jb7w/14.jpg",
    "title": "ShopSmart",
    "companyName": "Dealify",
    "id": 14,
    "description": "ShopSmart helps shoppers find the best deals, coupons, and discounts from thousands of online stores. It automatically compares prices and alerts you when items drop in cost. You can track wishlist items, apply promo codes instantly, and earn cashback on purchases. The app’s smart AI scans the web daily to bring you verified offers. With personalized recommendations and a user-friendly interface, ShopSmart ensures you always buy smartly and save more.",
    "size": 60,
    "reviews": 19300,
    "ratingAvg": 4.2,
    "downloads": 0.95,
    "ratings": [
      { "name": "1 star", "count": 1400 },
      { "name": "2 star", "count": 1600 },
      { "name": "3 star", "count": 2600 },
      { "name": "4 star", "count": 4200 },
      { "name": "5 star", "count": 8500 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Jw3PB3CS/15.png",
    "title": "NewsPulse",
    "companyName": "InfoNow",
    "id": 15,
    "description": "NewsPulse delivers real-time global news coverage from trusted sources. It personalizes your feed based on interests such as technology, sports, or politics. The app supports live updates, breaking news alerts, and offline reading mode. With an AI summarizer, you can catch up on major stories in seconds. NewsPulse encourages credible journalism by verifying sources and eliminating fake news. Stay informed, inspired, and connected with what’s happening worldwide.",
    "size": 68,
    "reviews": 17300,
    "ratingAvg": 4.3,
    "downloads": 1,
    "ratings": [
      { "name": "1 star", "count": 1200 },
      { "name": "2 star", "count": 1500 },
      { "name": "3 star", "count": 2200 },
      { "name": "4 star", "count": 3800 },
      { "name": "5 star", "count": 8600 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/twt8NNB9/16.webp",
    "title": "WeatherNow",
    "companyName": "ClimaTech",
    "id": 16,
    "description": "WeatherNow provides hyper-accurate, real-time weather forecasts for any location globally. It shows hourly, daily, and weekly trends with radar maps and storm alerts. The app uses AI modeling to predict rainfall and temperature changes precisely. Users can customize notifications for travel, outdoor plans, or severe weather conditions. Its minimal UI and dark mode make viewing pleasant anytime. Whether you’re planning your commute or a trip, WeatherNow keeps you prepared and safe.",
    "size": 65,
    "reviews": 21000,
    "ratingAvg": 4.5,
    "downloads": 1.7,
    "ratings": [
      { "name": "1 star", "count": 1000 },
      { "name": "2 star", "count": 1300 },
      { "name": "3 star", "count": 2100 },
      { "name": "4 star", "count": 4100 },
      { "name": "5 star", "count": 11500 }
    ]
  }
]
